tap "adoptopenjdk/openjdk"
tap "bufbuild/buf"
tap "derailed/k9s"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "shopify/private"
tap "shopify/shopify"
tap "withgraphite/tap"
brew "xz"
brew "zstd"
brew "automake"
brew "cairo"
brew "openssl@3"
brew "python@3.12"
brew "avro-tools"
brew "bash"
brew "binaryen"
brew "bison"
brew "capstone"
brew "cmake"
brew "colordiff"
brew "libyaml"
brew "python@3.13"
brew "copier"
brew "gmp"
brew "coreutils"
brew "cpio"
brew "crc32c"
brew "cyrus-sasl"
brew "diff-so-fancy"
brew "fswatch"
brew "fzf"
brew "fzy"
brew "gdbm"
brew "gh"
brew "git"
brew "git-lfs"
brew "glow"
brew "unbound"
brew "gnupg"
brew "go"
brew "golang-migrate"
brew "gradle"
brew "openjdk@17"
brew "gradle@7"
brew "gradle@8"
brew "graphviz"
brew "hadolint"
brew "helm"
brew "hugo"
brew "jq"
brew "kafka"
brew "kapp"
brew "librdkafka"
brew "kcat"
brew "kubeaudit"
brew "kubectx"
brew "kustomize"
brew "libffi"
brew "libomp"
brew "libpq"
brew "libxml2"
brew "llvm"
brew "lnav"
brew "maven"
brew "memcached"
brew "minikube"
brew "mockery"
brew "mysql-client"
brew "mysql-client@8.0"
brew "netcat"
brew "node"
brew "openjdk@21"
brew "openssl@1.1"
brew "pandoc"
brew "percona-server"
brew "percona-server@8.0"
brew "pipx"
brew "podman"
brew "podman-compose"
brew "pre-commit"
brew "protobuf"
brew "pyenv"
brew "python@3.11"
brew "readline"
brew "redis"
brew "ripgrep"
brew "ruby-build"
brew "ruby-install"
brew "rust"
brew "sbt"
brew "scala"
brew "shadowenv"
brew "shellcheck"
brew "socat"
brew "sqlite", link: true
brew "starship"
brew "tfenv"
brew "tmux"
brew "trivy"
brew "uv"
brew "velero"
brew "vsce"
brew "watch"
brew "watchman"
brew "websocat"
brew "wget"
brew "yamllint"
brew "yq"
brew "zellij"
brew "bufbuild/buf/buf"
brew "derailed/k9s/k9s"
brew "golangci/tap/golangci-lint"
brew "shopify/private/certloader"
brew "shopify/shopify/ejson"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty@tip"
cask "mactex"
cask "visualvm"
cask "shopify/shopify/zulu-jdk11"
cask "shopify/shopify/zulu-jdk17"
vscode "anthropic.claude-code"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.extension-test-runner"
vscode "redhat.java"
vscode "shopify.flink"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "shopify.vscode-shopify-internal"
vscode "sorbet.sorbet-vscode-extension"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
go "golang.org/x/tools/gopls"
cargo "sqlx-cli"
